# Created by steve on 17-11-6 下午9:31
'''
                   _ooOoo_ 
                  o8888888o 
                  88" . "88 
                  (| -_- |) 
                  O\  =  /O 
               ____/`---'\____ 
             .'  \\|     |//  `. 
            /  \\|||  :  |||//  \ 
           /  _||||| -:- |||||-  \ 
           |   | \\\  -  /// |   | 
           | \_|  ''\---/''  |   | 
           \  .-\__  `-`  ___/-. / 
         ___`. .'  /--.--\  `. . __ 
      ."" '<  `.___\_<|>_/___.'  >'"". 
     | | :  `- \`.;`\ _ /`;.`/ - ` : | | 
     \  \ `-.   \_ __\ /__ _/   .-` /  / 
======`-.____`-.___\_____/___.-`____.-'====== 
                   `=---=' 
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ 
         佛祖保佑       永无BUG 
'''


import os
import scipy as sp


if __name__ == '__main__':
    para_list = list()

    for first_info in [0.001,0.005,0.01,0.05,0.1,0.5,1.0,1.5,2.0,2.5,5.0,7.0,10.0,40.0,60.0,70.0]:
        for second_info in [0.001,0.005,0.01,0.05,0.1,0.5,1.0,1.5,2.0,2.5,5.0,7.0,10.0,40.0,60.0,70.0]:
            for ori_info in [0.001,0.005,0.01,0.05,0.1,0.5,1.0,1.5,2.0,2.5,5.0,7.0,10.0,40.0,60.0,70.0]:
                para_list.append("../cmake-build-debug/ImuOnlyGraph {0} {1} {2} ".format(
                    first_info,
                    second_info,
                    ori_info
                ))

    import random
    random.shuffle(para_list)


    for i in range(len(para_list)):
        print("i:------------------ is " , i,i,i,i,i,i,i,i)
        os.system(para_list[i])